#--------------------------------------------------------------
# AWSの設定
#--------------------------------------------------------------
# 東京リージョンを使用
aws_region = "ap-northeast-1"

#--------------------------------------------------------------
# プロジェクト設定
#--------------------------------------------------------------
# リソースのタグ付けと識別に使用するプロジェクト名
project_name = "amts-open-webui"

#--------------------------------------------------------------
# ドメイン設定
#--------------------------------------------------------------
# オリジンサーバー（EC2インスタンス）
origin_domain = "ec2-54-150-173-50.ap-northeast-1.compute.amazonaws.com"

# ドメイン設定
domain     = "sunwood-ai-labs.com"
subdomain  = "amaterasu-open-web-ui"  # 生成されるURL: amaterasu-open-web-ui.sunwood-ai-labs.com
